from telegram import Update
from telegram.ext import ApplicationBuilder, CommandHandler, ContextTypes
import requests
from bs4 import BeautifulSoup
#t.me/polovyi_bot.

async def hello(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    await update.message.reply_text(f'Hello {update.effective_user.first_name}')
async def read(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    await update.message.reply_text(f'Read:    {"Стоїть явір над водою,В воду похилився,На козака пригодонька Козак зажурився.Не хилися, явороньку,Ще ж ти зелененький,Не журися, козаченьку,Ще ж ти молоденький!Не рад явір хилитися -Вода корінь миє!Не рад козак журитися,Так серденько ниє. *Ой поїхав з України Козак молоденький -Оріхове сіделечко Ще й кінь вороненький.Ой поїхав на чужину Та там і загинув,Свою рідну Україну Навіки покинув.Звелів собі насипати Високу могилу,Звелів собі посадитиЧервону калину.Будуть пташки прилітати,Калиноньку їсти,Будуть мені приносити, З України вісті!"}')
async def help(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    await update.message.reply_text(f'Help {lst_comand}')
async def read1(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    await update.message.reply_text("""Моя любов — рожевий квіт
В весінньому саду,
Моя любов — веселий спів,
Що з ним я в світ іду.

О, як тебе кохаю я,
Єдиная моя!
Тому коханню не зміліть,
Хоч висхнуть всі моря.

Нехай посхнуть усі моря,
Потануть брили скал,
А ти навік любов моя,-
Аж згасне сонця пал,

Прощай, прощай, мій рідний край,
Прощай, моя любов,
Та де б не був я, мила, знай —
Прийду до тебе знов!""")

async def read2(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    await update.message.reply_text("""Коли настав чудовий май,
Садочків розвивання,
Тоді у серденьку моїм
Прокинулось кохання.

Коли настав чудовий май,
І пташок щебетання,
Тоді я милій розказав
Мою журбу й кохання.""")
async def read3(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    await update.message.reply_text("""Батько наш - Бандера,
Україна - мати,
Ми за Україну будем воювати!
Ой, у лісі, лісі, під дубом зеленим,
Там лежить повстанець тяженько ранений.
Ой, лежить він, лежить, терпить тяжкі муки,
Без лівої ноги, без правої руки.
Як прийшла до нього рідна мати його,
Плаче і ридає, жалує його.
Ой, сину ж мій, сину, вже навоювався,
Без правої ручки, без ніжки зостався
Мами ж наші, мами, не плачте за нами, ї
Не плачте за нами гіркими сльозами.
Батько наш - Бандера, Україна - мати,
Ми за Україну будем воювати!
А ми з москалями та й не в згоді жили,
На самого Петра у бій ми вступили
Москалі тікали, аж лапті губили,
А наші за ними постріли били.
Батько наш - Бандера, Україна - мати,
Ми за Україну будем воювати!
Ой, як мати сина свого поховала
На його могилі слова написала.
На його могилі слова написала: Слава Україні! Всім героям слава!""")
async def read4(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    await update.message.reply_text("""Мені казали "прівєт", мені казали "здравствуй"
І "давай до свіданія" казали мені
І все б це було нормально, все б це було нестрашно
Якби це було у Пітєрі або у Москві
Але такими словами мене стрічає столиця
Жовто-блакитної країни, що чекає на транш
Вона чомусь не розуміє моєї мови
Коли я кажу привіт, мене питають: "Ти со Львова?"
Ні, я з України: це навпроти Європи
Це там, де Хрещатик; це там, де Дніпро
Ні, я з України, проти вас я не проти
Але мені треба знати, хто тут хто
Так, я з України
Так, я з України
І на стіні колгоспник каже: "Все пучком"
І кожен день розпочинається кіном
І сорочина біла, і мова солов'їна
На усіх каналах: "Добрий вєчєр, Україна" (Україна)
І як тут бути, на що чекати?
Одна земля — і Донбас, і Карпати
Але не чує мене країна
Моя мова просто класна, а не солов'їна
Так, я з України: це навпроти Європи
Це там, де Хрещатик; це там, де Дніпро
Так, я з України, проти вас я не проти
Але мені треба знати, хто тут хто
Так, я з України: це навпроти Європи
Це там, де Хрещатик; це там, де Дніпро
Так, я з України, проти вас я не проти
Але мені треба знати, хто тут хто
Так, я з України
Так, я з України: це навпроти Європи
Це там, де Хрещатик; це там, де Дніпро
Так, я з України, проти вас я не проти
Але мені треба знати, хто тут хто
Так, я з України: це навпроти Європи
Це там, де Хрещатик; це там, де Дніпро
Так, я з України, проти вас я не проти
Але мені треба знати, хто тут хто
Так, я з України""")
async def read5(update: Update, context: ContextTypes.DEFAULT_TYPE) -> None:
    await update.message.reply_text("""В небі чистому чути грім
В небі свист, але чути гімн
В небі чистому мутний дим
Горить ліс, але чути гімн
В небі чистому чути грім
В небі свист, але чути гімн
В небі чистому мутний дим
Горить ліс, але чути гімн
За нами правда, значить вистоїм ми ваші вистріли
За нами правда, а її ніяк не пристрелить
За нами правда, значить визволим село ми за селом
За нами правда, значить ми з долин повиганяєм зло
Ну, а поки будем бить вас за Азов і Бучу
За Дні-, за Дніпро і кручі
За Ірпінь, який ти мучив
За ла-, за лани квітучі
За Херсон - землю родючу
За До-, за Донбас получиш
За Чернігів - неминуче
За лі-, за ліси дрімучі
За Хмельницького Богдана!
За Фра-, за Франка Івана!
І за Суми, і за храми
ЗСУ прийде за вами!
І за ночі, і за рани
За кожен тривожний ранок!
За Харків і тюльпани
За О-, за Одесу-маму
За Рівне і Здолбунів, за Полтаву, Львів і пулі
За Київ, Луцьк, за Вінницю, за Миколаїв - дулі
За Чернівці, Черкаси, Тернопіль і Кривий Ріг
За Запоріжжя і Житомир, і за Крим забуться - гріх
В небі чистому чути грім
В небі свист, але чути гімн
В небі чистому мутний дим
Горить ліс, але чути гімн
В небі чистому чути грім
В небі свист, але чути гімн
В небі чистому мутний дим
Горить ліс, але чути гімн
""")
app = ApplicationBuilder().token("7896946061:AAFh-ffyXo55yBQg5QuGn3muNbpSNLFk8bk").build()
app.add_handler(CommandHandler("hello", hello))
app.add_handler(CommandHandler("help", help))
app.add_handler(CommandHandler("read", read))
app.add_handler(CommandHandler("read1", read1))
app.add_handler(CommandHandler("read2", read2))
app.add_handler(CommandHandler("read3", read3))
app.add_handler(CommandHandler("read4", read4))
app.add_handler(CommandHandler("read5", read5))
lst_comand = """
/help = назви всіх команд
/hello = Привітання
/read = вірш Стоїть явір над водою
/read1 = Моя любов — рожевий квіт
/read2 = Коли настав чудовий май
/read3 = Батько наш - Бандера
/read4 = Я з україни
/read5 = Чути гімн

"""
app.run_polling()

